Revit 2027 API
BuiltInFailures.OpeningFailures.HostForCutHasNoGeometryWarn Property
 Host can't be cut because it has no geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HostForCutHasNoGeometryWarn { get; }
Public Shared ReadOnly Property HostForCutHasNoGeometryWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HostForCutHasNoGeometryWarn {
	FailureDefinitionId^ get ();
}
static member HostForCutHasNoGeometryWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OpeningFailures Class
Autodesk.Revit.DB Namespace